Tekla Open API Reference for Tekla Structures 2025
UnitAttributes Class
 The UnitAttributes class handles attributes related to units and formatting of values.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.UnitAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class UnitAttributes : GenericAttributesBase,
	ICloneable
<SerializableAttribute>
Public NotInheritable Class UnitAttributes
	Inherits GenericAttributesBase
	Implements ICloneable
The UnitAttributes type exposes the following members.
Constructors
Name | Description
UnitAttributes()
 Creates a new default UnitAttributes attributes instance. The default values are Units.Automatic, FormatTypes.Automatic.
UnitAttributes(Units, FormatTypes)
 Creates a new UnitAttributes attributes instance with the given parameters.
Top
Properties
Name | Description
Format
 Gets or sets the format to use.
Unit
 Gets or sets the unit to use.
Top
Methods
Name | Description
Clone
 Clones the object.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace